---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MechanicalSystemType.RiseDropSettings
source: html/cd3e7aa0-43f3-2007-cec2-069304c4ae64.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalSystemType.RiseDropSettings Property

indicates the rise/drop symbol given the system type

## Syntax (C#)
```csharp
public RiseDropSymbol RiseDropSettings { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input is not a valid HVAC rise/drop symbol type.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration